# Taps
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/bundle"
tap "nicoverbruggen/homebrew-cask"

# Shells
brew "bash"
brew "zsh"

# CLI Utilities
brew "coreutils"
brew "git"
brew "grep"
brew "svn"

# Other Tools
brew "imagemagick"
brew "libyaml"
brew "pkg-config"
brew "mysql"
brew "gnupg"
brew "gnupg2"

# Development
brew "composer"
brew "node"
brew "yarn"
brew "pnpm"
brew "fnm"

# Apps
cask "adobe-creative-cloud"
cask "bruno"
cask "discord"
cask "docker"
cask "dropbox"
cask "elmedia-player"
cask "httpie"
cask "jetbrains-toolbox"
cask "notion-calendar"
cask "phpstorm"
cask "postman"
cask "orbstack"
cask "slack"
cask "spotify"
cask "tableplus"
cask "tower"

# Browsers
cask "firefox"
cask "google-chrome"

# Fonts
cask "font-fira-code"
cask "font-open-sans"
cask "font-roboto"
cask "font-source-code-pro"
