# Shells
brew "bash"
brew "zsh"

# CLI Utilities
brew "coreutils"
brew "git"
brew "grep"
brew "svn"

# Other Tools
#brew "imagemagick"
brew "libyaml"
#brew "pkg-config"

# Development
#brew "composer"
#brew "node"
#brew "pnpm"

# Apps
cask "1password"
cask "adobe-creative-cloud"
cask "bruno"
cask "discord"
cask "docker"
cask "dropbox"
cask "jetbrains-toolbox"
cask "linear-linear"
cask "notion-calendar"
cask "phpstorm"
cask "postman"
cask "orbstack"
cask "slack"
cask "spotify"
cask "tableplus"
cask "tower"
cask "tuple"
cask "warp"

# Browsers
cask "firefox"
cask "google-chrome"

# Fonts
cask "font-fira-code"
cask "font-open-sans"
cask "font-roboto"
cask "font-source-code-pro"
